{
  "title_and_location": "Granger Lake Management Office Building Design, Granger, TX",
  "year_completed": {
    "professional_services": 2019,
    "construction": 2021
  },
  "project_owner": "USACE Fort Worth District",
  "point_of_contact_name": "Sharon Leheny, Project Manager – Sharon.v.leheny@usace.army.mil",
  "point_of_contact_telephone_number": "817-886-1563",
  "brief_description": "The Granger Lake Management staff required a new administrative office facility due to the presence of black mold that covered the entire front building walls due to moisture penetration. The design criteria included: a large conference room designed to accommodate up to 80 people while serving as a volunteer room during non-meeting times, a scenic view of Granger Lake from the conference room, increased water pressure from their old facility, and a large grandiose lobby area made to feel like the public was entering a lodge, complete with artifacts, a mammoth pelvis and animal mounts that were found on the Lake property. The client also required that the project schedule be cut by two months in order to facilitate the obligation of Recreational Funds before the end of the 2019 Fiscal Year. The resulting design package was completed before the end of the Federal fiscal year in 2019, and consisted of the development of a construction package for the remediation and demolition of the existing 5,890 SF lake management facility and the design of a new facility across Granger Dam Road from the existing facility. The new facility is one story and was designed for approximately 4,856 SF in gross area. The new construction inclusive of Architectural Services and all other required disciplines (i.e. electrical/mechanical/ fire protection/life safety/civil/structural). Design activities also included the design of landscaping, new paving, paving repairs, and force protection. The new facility houses offices for lake management staff, and a conference room to accommodate up to 60 people with tables and chairs. Site lighting was designed, along with parking for visitors and staff. Additionally, the fencing design required for the government vehicle and equipment compound behind the new office, was designed and included with the construction documents.",
  "firms_from_section_c_involved_with_this_project": [
    {
      "firm_name": "MSMM Engineering",
      "firm_location": "New Orleans, LA",
      "role": "Prime: Architecture, Civil, Structural, and MEP"
    },
    {
      "firm_name": "Huitt-Zollars, Inc.",
      "firm_location": "Fort Worth, TX",
      "role": "Sub: Civil, Structural, and ITR"
    }
  ]
}