{
  "title_and_location": "Renovation of 1st Cavalry Headquarters, Fort Hood, TX",
  "year_completed": {
    "professional_services": 2015,
    "construction": null
  },
  "project_owner": "USACE, Fort Worth District",
  "point_of_contact_name": "Patricia Murphy, PE",
  "point_of_contact_telephone_number": "817-886-1967",
  "brief_description": "Served as designer of record for the major renovation of an existing 135,800 gross SF, three-story Army Division Headquarters, including the existing courtyards. The project also included a roof-mounted antenna platform, parking area for tactical vehicles, loading and service areas, site/utilities. In general, the facility consists of three broad categories of space-administrative space, operational space, and building support space. In addition to the administrative and command operations spaces, the project included a new Operations Center (OC), Network Operations Center (NOC) and Sensitive Compartmented Information Facility (SCIF), including a Special Technical Operations (STO) Facility. The SCIF area was also served by an exterior Tactical SCI Vehicle Area (TSVA). Operationally critical areas of the facility were provided with redundant HVAC and the entire facility is served by a back-up generator in the event of a primary electrical failure. Provided 100% design construction documents in Revit and specifications in Specsintact for the civil, structural, mechanical, plumbing, electrical, and communication/IT/security (RCDD) systems. Design reviews were performed per the AEIM and recorded in Dr. Checks. The building is classified as a primary gathering facility and complies with UFC 4-010-01, DoD Minimum Antiterrorism Standards for Buildings and organized around three security zones based on the relative sensitivity of the operational activities performed in those zones.\n- Security Zone 1 includes Command Group, Protocol, PAO, G4, G8, G1, Legal, SHARP, IG, EO, Chaplain, Safety, Surgeon, Commandant, Honor Guard, Message Center/Distribution Room, Security Office, and PR. Although access into the entire building is controlled, this zone has the least operational sensitivity.\n- Security Zone 2 includes Retention, G3 AVN, G3 SCHOOLS/FID/KMO, G3 FUOPS, G5 with ORSA and RED TEAM, PMO, Protection, DIV ENG, AMD, FIRES, G6, G7, G9 and CBRNE, Team Rooms, Command Briefing Room, Open Conference Rooms, Language and Computer-Based Training Room.\n- Security Zone 3 includes G2 and Operations Center. Security Zone 3 is the highest level of operations sensitivity.",
  "firms_from_section_c_involved_with_this_project": [
    {
      "firm_name": "Huit-Zollars, Inc.",
      "firm_location": "Fort Worth, TX; Dallas, TX",
      "role": "Designer of Record, Construction Administration"
    }
  ]
}