{
  "content": "F. EXAMPLE PROJECTS WHICH BEST ILLUSTRATE PROPOSED TEAM’S 20.EXAMPLE\nPROJECT KEY\nQUALIFICATIONS FOR THIS CONTRACT\nNUMBER\nPresent as many projects as requested by the agency, or 10 projects if not specified.\nF-3\n(Complete one Section F for each project.)\n21.TITLE AND LOCATION (City and State) 22.YEAR COMPLETED\nPROFESSIONAL SERVICES CONSTRUCTION (If applicable)\nVE Study - Corpus Christi Ship Channel - PA 10 - Shoreline 2018 2022\nProtection/Stabilization - Containment Dike Raise, Texas\na.PROJECT OWNER b.POINT OF CONTACT c.TELEPHONE NUMBER\nMr. Jake Walsdorf, PLA\nUSACE, Galveston District 409-766-3817\nVEO/A-E Contract Coordinator\n24.BRIEF DESCRIPTION OF PROJECT AND RELEVANCE TO THIS CONTRACT (Include scope, size, cost)\nPrime Firm: MSMM Engineering – Contract W9126G-16-D-0017, Task Order # W9126G18F0159 – Subconsultant – Neelu, Inc.\nOur team was tasked by the USACE Galveston District with completing a Value Engineering Study for the potential Containment Dike Raise\nalong the Corpus Christi Ship Channel in Corpus Christi, Texas. We conducted a 4-day value engineering study evaluating the design to\nrepair the stone jetties at the entrance to the Corpus Christi Ship Channel. The plans called for deepening the entrance channel by 7 ft. to\nan authorized depth of -52 ft. MLT. This results in the entrance channel bottom depth being lowered by 2 ft. to -54 MLT and extending it by\n10,000 feet further into the Gulf of Mexico. Thus, the jetties need significant improvements/repairs. Utilizing the SAVE method, the VE team\nevaluated the $50M construction estimate and project documentation, eventually developing 7 alternatives that were accepted for a net\nsavings of approximately $1.75, which resulted in the re-evaluation of the entire scope of the project by the Galveston District design team.\nProject Description:\nCCSC PA10 is located on the south side of Corpus Christi Ship Channel, to the northwest of Corpus Christi Bay, and south of Ingleside in San Patricio\nCounty Texas.\nThe average containment dike elevation of PA10 is about 32 feet from survey\ntaken in 2013 (as presented in the survey plot from station 68+00 to station\n71+00 in Section II. The proposed plan is to optimize erosion protection\nbeginning at station 65+00 and ending at station 99+00 which makes the total\ndesign length of the erosion prevention construction 3,400 linear feet.\nAdditionally, the Dike is proposed to be raised to a uniform elevation +40 feet,\nalong with a PA expansion towards the northeast and relocation of the spill box\nnorthward.\nConstruction Cost:\nTotal Construction Budget at the Design Development (35%) phase totals\napproximately $8 million (not including contingency).\nVE Workshop: May 22-25, 2018.\nFacilitated by Ramesh Kalvakaalva, PE, CVS of Neelu Inc, Team Members\nwere provided by MSMM, Neelu Inc and USACE Galveston District.\nSMEs included: Civil; Hydraulics; Geotechnical; Constructability; Operations;\nCost Estimator\nThe VE Workshop adhered to the USACE Value Standard and the six step Value\nEngineering job plan as promulgated by SAVE International®. This six-step job plan included:\nI. Information Phase; II. Function Analysis Phase; III. Speculation/Creative Phase; IV.\nEvaluation Phase; V. Development Phase; VI. Presentation Phase. A FAST Diagram was\ndeveloped to validate the Scope of the Operations and enable the VE Team to focus on the\nFunctions identified as High Risk.\nThe VE Facilitator and PM also participated in the Implementation Meeting.\nObjectives of the VE Study:\n Get the best return for construction dollars spent\n Assist in bringing the project within budget\n Assist in identifying the best approach for project delivery\n Reduce the risks associated with project delivery\n Minimize Life Cycle Costs for O & M\n Enhance the project outcome\nSF 330 Part 1 STANDARD FORM 330 (REV. 8/2016)\nF-925.FIRMS FROM SECTION C INVOLVED WITH THIS PROJECT\nFIRM NAME (2)FIRM LOCATION (City and State) (3)ROLE\nProject Management / VE Team Members\n(Co-Facilitator/Cost Estimator: Don “D” Daigle, CVS,\nMSMM Engineering, LLC New Orleans, LA, Houston, TX\nCCP; Civil: Jim Wilson, PE, PM: Josh Carson)\nVE Facilitation / VE Team Members\nNeelu, Inc. Smyrna, GA (Facilitator: Ramesh Kalvakaalva, PE, CVS; Geotech:\nGarfield Wray, PE, D.GE, Constructability: Charles\nMcDuff, PE, CVS-Life)\nSF 330 Part 1 STANDARD FORM 330 (REV. 8/2016)\nF-12"
}