{
  "content": "MATOC For A-E Design Services for Military Programs for the Fort Worth District and Southwestern Division AOR\nW9126G-20-R-0041 - SMALL BUSINESS\nJanuary 5, 2022\nF. EXAMPLE PROJECTS WHICH BEST ILLUSTRATE PROPOSED TEAM’S 20. EXAMPLE PROJECT KEY\nQUALIFICATIONS FOR THIS CONTRACT NUMBER\n(Present as many projects as requested by the agency, or 10 projects, if not specified. Complete one Section F for each project.) 1\n21. TITLE AND LOCATION (City and State) 22. YEAR COMPLETED\nRenovation of 1st Cavalry Headquarters | Contract No. W9126G-15-C-0251 | Fort Hood, PROFESSIONAL SERVICES CONSTRUCTION (If applicable)\nTX 2018 2019\n23. PROJECT OWNER’S INFORMATION\na. PROJECT OWNER b. POINT OF CONTACT NAME c. POINT OF CONTACT TELEPHONE NUMBER\nUSACE, Fort Worth District Patricia Murphy, PE 817-886-1967\n24. BRIEF DESCRIPTION OF PROJECT AND RELEVANCE TO THIS CONTRACT (Include scope, size, and cost)\nServed as designer of record for the major renovation of an existing 135,800 gross SF, three-story Army Division\nProject Details\nHeadquarters, including the existing courtyards. The project also included a roof-mounted antenna platform,\nparking area for tactical vehicles, loading and service areas, site/utilities. In general, the facility consists of Size: 135,800 SF\nthree broad categories of space—administrative space, operational space, and building support space. In Construction Value: $52,139,000\naddition to the administrative and command operations spaces, the project included a new Operations Center Total Fee: $1,028,231\n(OC), Network Operations Center (NOC) and Sensitive Compartmented Information Facility (SCIF), including\nOfferor’s % of Work: 100%\na Special Technical Operations (STO) Facility. The SCIF area was also served by an exterior Tactical SCI\nRelevant Factors\nVehicle Area (TSVA). Operationally critical areas of the facility were provided with redundant HVAC and the\nentire facility is served by a back-up generator in the event of a primary electrical failure. 9 USACE/SWF Task Order\nProvided 100% design construction documents in Revit and specifications in Specsintact for the civil, 9 Fee Over $1 M\nstructural, mechanical, plumbing, electrical, and communication/IT/security (RCDD) systems. Design reviews 9 Located In TX\nwere performed per the AEIM and recorded in Dr. Checks. 9 Completed Since 2016\n9 Full Design\nThe building is classified as a primary gathering facility and complies with UFC 4-010-01, DoD Minimum\n9 Major Renovation\nAntiterrorism Standards for Buildings and organized around three security zones based on the relative\n9 Value Engineering\nsensitivity of the operational activities performed in those zones:\n9 Commissioning\n• Security Zone 1 includes Command Group, Protocol, PAO, G4, G8, G1, Legal, SHARP, IG, EO, Chaplain,\nSafety, Surgeon, Commandant, Honor Guard, Message Center/Distribution Room, Security Office, and PR. Although access into the entire building is\ncontrolled, this zone has the least operational sensitivity.\n• Security Zone 2 includes Retention, G3 AVN, G3 SCHOOLS/FID/KMO, G3 FUOPS, G5 with ORSA and RED TEAM, PMO, Protection, DIV ENG, AMD,\nFIRES, G6, G7, G9 and CBRNE, Team Rooms, Command Briefing Room, Open Conference Rooms, Language and Computer-Based Training Room.\n• Security Zone 3 includes G2 and Operations Center. Security Zone 3 is the highest level of operations sensitivity.\nThe 16-acre site designs included new water, sewer, fire protection, natural gas, electrical and communications concrete duct banks. The new water and sewer\nservices were coordinated with the utility provider American Water and designs prepared to meet the Fort Hood specifications and details as well as UFC 3-201-\n01. The parking include 636 spaces and meet the 82 ft setback and included 2% dedicated to the handicapped per ABA. All new pavement design was per UFC\n3-250-01FA and TxDOT specifications. The addition of the TSVA parking area included FE-6 fencing and other security requirements per guidance by the USACE\nProtective Design Center. New dumpster enclosures and screen walls for the utility yard were also designed to meet the Fort Hood standards and UFC 3-201-01.\nNew windows were provided to meet AT/FP based on the setback with structural mullions and openings designed to withstand 2X the load of the glazing per ASTM\n1300. This required some additional reinforcement on larger windows and curtain walls with high strength structural steel structural mullions. Exterior walls were\nthickened with additional studs also allowing for additional space for insulation.\nThe new HVAC system included a four-pipe on-site generated chilled water (550 tons) and heating system supplying the central-station air-handling units with\nredundancy designed to the facility’s critical zones. Distribution is via multi-zone VAV air handling units mixed with outside air through dedicated units with exhaust\nair recovery (DOAS). The system is controlled by a DDC that integrates with Fort Hood’s UMCS and is designed with AT/FP shutdown per UFC 4-010-01. New\nHVAC system and envelope design complies with ASHRAE 189.1 and energy models show a consumption reduction greater than 20% over ASHRAE 90.1\nbaseline All lighting and lighting controls were designed per UFC 3-530-01 and ASHRAE 90.1 and included LED fixtures and occupancy sensors. New plumbing\nand hot water designed to meet ASHRAE 189.1 and sub-metering to meet LEED credit requirements. The entire project is certified by USGBC as LEED Silver.\nCommunication system design included new SIPRNET in classified exposed cable trays and NIPRNET per 13A and UFC 4-021-02NF and included external\nconnections for the vehicles in the TSVA. Due to the sensitive nature of the facility, electronic security systems, access control, intrusion detection and CCTV\nsystem infrastructure were designed in accordance with UFC 4-021-02NF and the users’ specifications, which were developed through multiple meetings and\ninterviews. Redundant power for the entire building was designed with a 2,000 KW diesel backup generator with 72 hours of fuel storage.\n25. FIRMS FROM SECTION C INVOLVED WITH THIS PROJECT\n(1) FIRM NAME (2) FIRM LOCATION (City and State) (3) ROLE\na. Huitt-Zollars, Inc. Fort Worth, TX; Dallas, TX Designer of Record, Construction Administration\nF – 1 STANDARD FORM 330 (REV. 7/2021)"
}