{
  "content": "20. EXAMPLE PROJECT KEY\nF. EXAMPLE PROJECTS WHICH BEST ILLUSTRATE PROPOSED TEAM’S NUMBER\nQUALIFICATIONS FOR THIS CONTRACT\n(Present as many projects as requested by the agency, or 10 projects, if not specified. Complete one Section F for each project.)\n1\n21. TITLE AND LOCATION (City and State) 22. YEAR COMPLETED\nPROFESSIONAL SERVICES CONSTRUCTION (If applicable)\nGranger Lake Management Office Building Design\n2019 2021\nGranger, TX\n23. PROJECT OWNER’S INFORMATION\na. PROJECT OWNER b. POINT OF CONTACT NAME c. POINT OF CONTACT TELEPHONE NUMBER\nSharon Leheny, Project Manager –\nUSACE Fort Worth District 817-886-1563\nSharon.v.leheny@usace.army.mil\n24. BRIEF DESCRIPTION OF PROJECT AND RELEVANCE TO THIS CONTRACT (Include scope, size, and cost)\n• Administrative Building Design • Sustainable Design Features\nExample of Major Project\n• Visitor Center Design • Accelerated Design Schedule\nType: Architectural Services\n• Seismic Engineering\nThe Granger Lake Management staff required a new administrative office facility due to the presence of black mold\nthat covered the entire front building walls due to moisture penetration. They had a key list of design criteria that our\nstaff designed to, which included: a large conference room designed to accommodate up to 80 people while serving\nas a volunteer room during non-meeting times, a scenic view of Granger Lake from the conference room, increased\nwater pressure from their old facility, and a large grandiose lobby area made to feel like the public was entering a\nlodge, complete with artifacts, a mammoth pelvis and animal mounts that were found on the Lake property. The\nclient also required that the project schedule be cut by two months in order to facilitate the obligation of Recreational\nFunds before the end of the 2019 Fiscal Year. In order to do this, our project team coordinated directly with the local\nwater purveyor and sewer permitting districts to expedite the filing, review and approval of the septic permit, and for\nthe immediate construction of a pipe size increase and extension of a waterline to provide the site with increased\nwater pressure and availability.\nThe resulting design package was completed before the end of the Federal fiscal year in 2019, and consisted of the\ndevelopment of a construction package for the remediation and demolition of the existing 5,890 SF lake\nmanagement facility located at 3100 Granger Dam Road, Granger, TX, and the design of a new facility across\nGranger Dam Road from the existing facility. The new facility is one story and was designed for approximately 4,856\nSF in gross area. The new construction inclusive of Architectural Services and all other required disciplines\n(i.e. electrical/mechanical/ fire protection/life safety/civil/structural). Design activities also included the design\nof landscaping, new paving, paving repairs, and force protection. The new facility houses offices for lake\nmanagement staff, and a conference room to accommodate up to 60 people with tables and chairs. Site lighting was\ndesigned, along with parking for visitors and staff. Additionally, the fencing design required for the government\nvehicle and equipment compound behind the new office, was designed and included with the construction\ndocuments.\nAs to sustainability features, the building is oriented with the long\nsides facing north/south and the narrow sides facing east/west.\nThe lake view is toward the south while the view north is of the\nparking areas and the neighboring property beyond. All of the\nwindows and glass doors feature double paned glass separated by\nan air space with a Low- E coating on the inner face of the outer\nglass panel – all for maximum energy efficiency. As the largest\nwindows are facing south towards the view, USACE plans to add\na covered porch in the near future along the south facing portion of\nthe building to block out the direct southern sun. The north facing\nwindows within the Multi-Purpose Room are located high on the\nwall under the roof overhang. The entrance doors and windows are protected by an exterior rain/sun shading\noverhang. The east and west elevations have minimum fenestration. The four office windows facing south have\nBahama shutters. Closed cell foam insulation is used in the walls and roof for maximum insulation value. The roof\nsystem includes a bright galvanized metal roof that increases the roof’s solar reflectance index value.\nThe Prime completed all of the mechanical design for this facility. The mechanical design consisted of heating,\nventilating, air conditioning, refrigeration, energy, piping and plumbing systems. Mechanical design for the facility\n45 of 64complied with the following codes: International Mechanical Code (IMC), International Plumbing Code (IPC),\nNational Fire Protection Association (NFPA), Sheet Metail and Air Conditioning Contractors National Association\n(SMACNA), American Society of Heating, Refrigerating and Air Conditioning (ASHRAE) and the Americans with\nDisabilities Act (ADA). For HVAC, the facility was designed to utilize a standard split system style direct expansion\nsystem with indoor air handling units and outdoor condensing units with one system dedicated to providing\nconditioned outside air to the space. The indoor units utilize electric heat strips for winter conditions. Generally, the\nbuilding was designed to be conditioned by multiple direction expansion coil type air handing units with electric heat.\nFor exhaust, the Men and Women restrooms, Janitor Room, and Lobby restroom exhaust system were all designed\nto discharge through a single roof penetration located near the restrooms.\nSanitary sewer was designed so that al sewer waste dischare to a single point located along the North end of the\nbuilding. The following sanitary sewer fixtures were included with the design package: Two Compartment Sink\n(Break Room -1), Lavoratories (Women, Men and Lobby Restrooms – 5), Flush Valve Water Closets ( Woman, Men\nand Lobby Restrooms – 6), Floor Drains (Women, Men and Lobby Restrooms – 4), Urinal – Flush Valve (Men\nRestroom), High/Low Drinking Fountain (Rear Lobby – 1), Service Sink (Janitor Closet -1), Condensate Discharge\nfrom AHU’s located above celing – 2, and discharge from the ice machine (break room – 1).\n25. FIRMS FROM SECTION C INVOLVED WITH THIS PROJECT\n(1) FIRM NAME (2) FIRM LOCATION (City and State) (3) ROLE\nPrime: Architecture, Civil, Structural,\nMSMM Engineering New Orleans, LA\nand MEP\n(1) FIRM NAME (2) FIRM LOCATION (City and State) (3) ROLE\nHuitt-Zollars, Inc. Fort Worth, TX Sub: Civil, Structural, and ITR\n46 of 64"
}