{
  "content": "MATOC For A-E Design Services for Military Programs for the Fort Worth District and Southwestern Division AOR\nW9126G-20-R-0041 - SMALL BUSINESS\nJanuary 5, 2022\nF. EXAMPLE PROJECTS WHICH BEST ILLUSTRATE PROPOSED TEAM’S 20. EXAMPLE PROJECT KEY\nQUALIFICATIONS FOR THIS CONTRACT NUMBER\n(Present as many projects as requested by the agency, or 10 projects, if not specified. Complete one Section F for each project.) 2\n21. TITLE AND LOCATION (City and State) 22. YEAR COMPLETED\nBuilding 373 Dynamometer Facility and Equipment Upgrades | Contract No. W9126G- PROFESSIONAL SERVICES CONSTRUCTION (If applicable)\n11-D-0005 | Task Order No. 0028 | Red River Army Depot, Texarkana, TX 2017 2018\n23. PROJECT OWNER’S INFORMATION\na. PROJECT OWNER b. POINT OF CONTACT NAME c. POINT OF CONTACT TELEPHONE NUMBER\nUSACE Fort Worth District Lynn Ray (now with SWD) 469-487-7064\nKip Browning (RRAD) 903-334-3232\n24. BRIEF DESCRIPTION OF PROJECT AND RELEVANCE TO THIS CONTRACT (Include scope, size, and cost)\nThis $22M project is to design the update and renovation of Building 373. The dynamometer facility (Bldg 373)\nProject Details\nat Red River Army Depot is includes areas for rebuild and test and reassembly of the vehicles and equipment.\nThe dynamometers are used to test the engines and transmissions rebuilt in the MSSC shop. Each new Size: 14,000SF\nengine dynamometer will be served from a new centralized diesel fuel storage and delivery system as well as Construction Value: $22,000,000\nnew centralized oil, ATF and coolant distribution and collection systems. The engine dynamometers will use Total Fee: $1,161,820\nelectrically generated eddy current resistance. Heat rejection from the engines and the dynamometers will be\nOfferor’s % of Work: 70%\nby a new cooling water supply loop and cooling tower. Engine exhaust will be through appropriate new muffler\nRelevant Factors\nsystems in each cell.\nOur team provided project management, multi-discipline A-E Design developing Design-Bid-Build plans, 9 USACE/SWF Task Order\nSpecsIntact specifications, design analysis, energy modeling, and coordination of several specialty equipment 9 Fee Over $1 M\nsubconsultants. The MII CWEs were prepared for the 65%, 95% and 100% design packages. The multi- 9 Located In TX\ndiscipline design team included:\n9 Completed Since 2016\n• Architecture, • Electrical Engineering 9 Major Renovation\n• Civil Engineering • Communications Design 9 Design Bid Build\n• Structural Engineering & ATFP Compliance • Landscape Architecture 9 Value Engineering\n• Mechanical Engineering • Interior Design/CID/SID 9 Construction Phase Services\n9 Commissioning\n• Fueling Design\nOur team facilitated splitting the project into three construction packages:\n• Building renovation\n• Equipment and installation including process piping systems\n• Selective building demolition, reconstruction, and installation of a new cross-drive transmission dynamometer.\nA feasibility study and cost estimate was prepared comparing the design options for cooling water requirements. The outcome of the study determined the project\ncould accommodate the same cooling system for both new and relocated transmission dynamometers. We prepared design of the heat rejection cooling water\nloop.\nSustainability and Energy Efficiency: The project followed the UFC 1-200-02 and the Army LEED implementation Guide. The mechanical engineers prepared a\nenergy model and compared final design elements to ensure the HVAC system met ASHRAE 90.1 focusing specifically on the energy efficiency of the large motors\nand HVAC loads. Other elements to meet LEED and LCCA payback requirements per UFC 3-200-02 were revised such as facility layout, daylighting and lighting\ncontrols. Our team prepared the design plans for the new dynamometer equipment, including fluid management and cooling, overhead cranes, and all utilities.\nThe design-bid-build construction package included consideration of all current UFCs, IBC, NFPA, IEEE and the Red River Army Depot Architectural Compatibility\nand Interior Design Standards. All submittals were coordinated with the government reviewers via Dr. Checks.\n25. FIRMS FROM SECTION C INVOLVED WITH THIS PROJECT\n(1) FIRM NAME (2) FIRM LOCATION (City and State) (3) ROLE\nHuitt-Zollars, Inc. Fort Worth, TX Designer and Architect-Engineer of record for architectural,\na. civil, structural, MEP, communications/data/security systems\n(RCDD) engineering, civil engineering, surveying\nF – 2 STANDARD FORM 330 (REV. 7/2021)"
}